ruby/W.org
#+TITLE:     W
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+STARTUP:   showall
#+TOC:       headlines 3
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: <a href="#bottom">⇩</a>
#+HTML: <a id="top"/>
#+HTML: </div>



* [[https://wordsinasentence.com/wane-in-a-sentence/][Wane]]

  =to gradually decrease in value or intensity=

  - When the investigators ran out of leads, the intensity of the murder investigation started to wane.
  - John asked his wife for a divorce when his feelings for her started to wane.
  - Since sales have started to wane, the store is in danger of becoming unprofitable.
  - Hopefully my daughter’s interest in the tuba will soon wane so my house can be quiet again.
  - Ben knows his financial woes will wane as soon as he gets a job.
  - Due to budget cuts, the nonessential services offered by the county will begin to wane in December.
  - If Colin is not winning a game, his interest will wane to the point he no longer wants to play.

* [[https://wordsinasentence.com/warp-in-a-sentence/][Warp]]

  =to twist into a different or abnormal shape=

  - If the chair gets wet, the wood will warp and make the furniture uncomfortable for sitting.
  - The hot temperature in the car may warp the movie disc and make it unplayable.
  - As a result of the scorching heat, the plastic lawn furniture has started to warp into an abnormal form.
  - The sculptor uses tools to warp scrap metal into unique works of art.

* [[https://wordsinasentence.com/wary-in-a-sentence/][Wary]]

  =caution; guarded; careful=

  - One of the most important lessons that parents must teach young children is to always be wary of strangers.
  - Fluffy gave her owners a wary look when they walked in the door with a new puppy.
  - Despite their employer’s assurances, the workers were wary of the changes he was requiring in their contracts.
  - After they had lost one horse to a rattlesnake bite, the riders remained wary of their surroundings as they made their way through the desert.
  - I’ve told my mother to be wary of telemarketers because so many of them prey on elderly widows.
  - Despite my warning for the children to be gentle with the baby rabbits, their rowdy behavior has made the poor bunnies wary and nervous.
  - He could tell that she didn’t trust him from the wary expression on her face.

* [[https://wordsinasentence.com/weather-in-a-sentence/][Weather]]

  =the state of the air and atmosphere in a specific place and time=

  - Rainy weather ruined our family picnic soon after we arrived at the park.
  - Because of the stormy weather, the children must play indoors only.
  - The newsman gave a weather report that called for over two inches of snow over the next twelve hours.
  - Florida’s sunny weather makes it the perfect place to go on a vacation.

* [[https://wordsinasentence.com/welter-in-a-sentence/][Welter]]

  =wild disorder=

  - The classroom was in a welter when the teacher did not show up for class.
  - The frenzied football fans were in the throes of a welter during the final few moments of the game.
  - Because she has an issue with hoarding, my grandma’s house is always in a welter.
  - The animals at the zoo were always in a welter right before feeding time.

* [[https://wordsinasentence.com/whimsical-in-a-sentence/][Whimsical]]

  =in an amusing or playful manner=

  - The whimsical music made me feel like a little kid again.
  - During the party, our host asked us to join him in a whimsical game of make-believe.
  - The author turned out to be just as whimsical as the magical characters in her children’s book.
  - When we went into the interactive candy store, we felt as though we were in a whimsical world made of chocolate.
  - It will be interesting to see how my serious mother-in-law responds to the whimsical present I am giving her for her birthday.
  - After being stuck in my accountant’s office all day, I looked forward to escaping to the whimsical fantasy game I played with my friends.
  - The portrait of the dogs and cats playing cards together is one of the painter’s most whimsical pieces.

