ruby/W.html
<!DOCTYPE html>
<html>
<head>
<title>W</title>
<!-- 2018-05-22 Tue 22:08 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">W</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Wane</a></li>
<li><a href="#sec-2">2. Warp</a></li>
<li><a href="#sec-3">3. Wary</a></li>
<li><a href="#sec-4">4. Weather</a></li>
<li><a href="#sec-5">5. Welter</a></li>
<li><a href="#sec-6">6. Whimsical</a></li>
<li><a href="#sec-7">7. Whimsy</a></li>
<li><a href="#sec-8">8. Whittle</a></li>
<li><a href="#sec-9">9. Willful</a></li>
<li><a href="#sec-10">10. Wilt</a></li>
<li><a href="#sec-11">11. Wistful</a></li>
<li><a href="#sec-12">12. Withstood</a></li>
<li><a href="#sec-13">13. Witty</a></li>
<li><a href="#sec-14">14. Waddle</a></li>
<li><a href="#sec-15">15. Waggish</a></li>
<li><a href="#sec-16">16. Waive</a></li>
<li><a href="#sec-17">17. Wallop</a></li>
<li><a href="#sec-18">18. Wallow</a></li>
<li><a href="#sec-19">19. Wan</a></li>
<li><a href="#sec-20">20. Wanton</a></li>
<li><a href="#sec-21">21. Wastrel</a></li>
<li><a href="#sec-22">22. Waver</a></li>
<li><a href="#sec-23">23. Waylay</a></li>
<li><a href="#sec-24">24. Wean</a></li>
<li><a href="#sec-25">25. Weary</a></li>
<li><a href="#sec-26">26. Wend</a></li>
<li><a href="#sec-27">27. Wheedle</a></li>
<li><a href="#sec-28">28. Wheeze</a></li>
<li><a href="#sec-29">29. Whet</a></li>
<li><a href="#sec-30">30. Whiff</a></li>
<li><a href="#sec-31">31. Whim</a></li>
<li><a href="#sec-32">32. Whimper</a></li>
<li><a href="#sec-33">33. Whine</a></li>
<li><a href="#sec-34">34. Wholesome</a></li>
<li><a href="#sec-35">35. Wield</a></li>
<li><a href="#sec-36">36. Wily</a></li>
<li><a href="#sec-37">37. Wince</a></li>
<li><a href="#sec-38">38. Windfall</a></li>
<li><a href="#sec-39">39. Winnow</a></li>
<li><a href="#sec-40">40. Wiry</a></li>
<li><a href="#sec-41">41. Wispy</a></li>
<li><a href="#sec-42">42. Wither</a></li>
<li><a href="#sec-43">43. Wizened</a></li>
<li><a href="#sec-44">44. Wobble</a></li>
<li><a href="#sec-45">45. Wrath</a></li>
<li><a href="#sec-46">46. Wreak</a></li>
<li><a href="#sec-47">47. Wrenching</a></li>
<li><a href="#sec-48">48. Wrest</a></li>
<li><a href="#sec-49">49. Wretched</a></li>
<li><a href="#sec-50">50. Writ</a></li>
<li><a href="#sec-51">51. Wrought</a></li>
<li><a href="#sec-52">52. Wry</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Wane</a></li>
<li><a href="#sec-2">2. Warp</a></li>
<li><a href="#sec-3">3. Wary</a></li>
<li><a href="#sec-4">4. Weather</a></li>
<li><a href="#sec-5">5. Welter</a></li>
<li><a href="#sec-6">6. Whimsical</a></li>
<li><a href="#sec-7">7. Whimsy</a></li>
<li><a href="#sec-8">8. Whittle</a></li>
<li><a href="#sec-9">9. Willful</a></li>
<li><a href="#sec-10">10. Wilt</a></li>
<li><a href="#sec-11">11. Wistful</a></li>
<li><a href="#sec-12">12. Withstood</a></li>
<li><a href="#sec-13">13. Witty</a></li>
<li><a href="#sec-14">14. Waddle</a></li>
<li><a href="#sec-15">15. Waggish</a></li>
<li><a href="#sec-16">16. Waive</a></li>
<li><a href="#sec-17">17. Wallop</a></li>
<li><a href="#sec-18">18. Wallow</a></li>
<li><a href="#sec-19">19. Wan</a></li>
<li><a href="#sec-20">20. Wanton</a></li>
<li><a href="#sec-21">21. Wastrel</a></li>
<li><a href="#sec-22">22. Waver</a></li>
<li><a href="#sec-23">23. Waylay</a></li>
<li><a href="#sec-24">24. Wean</a></li>
<li><a href="#sec-25">25. Weary</a></li>
<li><a href="#sec-26">26. Wend</a></li>
<li><a href="#sec-27">27. Wheedle</a></li>
<li><a href="#sec-28">28. Wheeze</a></li>
<li><a href="#sec-29">29. Whet</a></li>
<li><a href="#sec-30">30. Whiff</a></li>
<li><a href="#sec-31">31. Whim</a></li>
<li><a href="#sec-32">32. Whimper</a></li>
<li><a href="#sec-33">33. Whine</a></li>
<li><a href="#sec-34">34. Wholesome</a></li>
<li><a href="#sec-35">35. Wield</a></li>
<li><a href="#sec-36">36. Wily</a></li>
<li><a href="#sec-37">37. Wince</a></li>
<li><a href="#sec-38">38. Windfall</a></li>
<li><a href="#sec-39">39. Winnow</a></li>
<li><a href="#sec-40">40. Wiry</a></li>
<li><a href="#sec-41">41. Wispy</a></li>
<li><a href="#sec-42">42. Wither</a></li>
<li><a href="#sec-43">43. Wizened</a></li>
<li><a href="#sec-44">44. Wobble</a></li>
<li><a href="#sec-45">45. Wrath</a></li>
<li><a href="#sec-46">46. Wreak</a></li>
<li><a href="#sec-47">47. Wrenching</a></li>
<li><a href="#sec-48">48. Wrest</a></li>
<li><a href="#sec-49">49. Wretched</a></li>
<li><a href="#sec-50">50. Writ</a></li>
<li><a href="#sec-51">51. Wrought</a></li>
<li><a href="#sec-52">52. Wry</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-05-22 22:08:39</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>



<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/wane-in-a-sentence/">Wane</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>to gradually decrease in value or intensity</code>
</p>

<ul class="org-ul">
<li>When the investigators ran out of leads, the intensity of the murder investigation started to wane.
</li>
<li>John asked his wife for a divorce when his feelings for her started to wane.
</li>
<li>Since sales have started to wane, the store is in danger of becoming unprofitable.
</li>
<li>Hopefully my daughter’s interest in the tuba will soon wane so my house can be quiet again.
</li>
<li>Ben knows his financial woes will wane as soon as he gets a job.
</li>
<li>Due to budget cuts, the nonessential services offered by the county will begin to wane in December.
</li>
<li>If Colin is not winning a game, his interest will wane to the point he no longer wants to play.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/warp-in-a-sentence/">Warp</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>to twist into a different or abnormal shape</code>
</p>

<ul class="org-ul">
<li>If the chair gets wet, the wood will warp and make the furniture uncomfortable for sitting.
</li>
<li>The hot temperature in the car may warp the movie disc and make it unplayable.
</li>
<li>As a result of the scorching heat, the plastic lawn furniture has started to warp into an abnormal form.
</li>
<li>The sculptor uses tools to warp scrap metal into unique works of art.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/wary-in-a-sentence/">Wary</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>caution; guarded; careful</code>
</p>

<ul class="org-ul">
<li>One of the most important lessons that parents must teach young children is to always be wary of strangers.
</li>
<li>Fluffy gave her owners a wary look when they walked in the door with a new puppy.
</li>
<li>Despite their employer’s assurances, the workers were wary of the changes he was requiring in their contracts.
</li>
<li>After they had lost one horse to a rattlesnake bite, the riders remained wary of their surroundings as they made their way through the desert.
</li>
<li>I’ve told my mother to be wary of telemarketers because so many of them prey on elderly widows.
</li>
<li>Despite my warning for the children to be gentle with the baby rabbits, their rowdy behavior has made the poor bunnies wary and nervous.
</li>
<li>He could tell that she didn’t trust him from the wary expression on her face.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/weather-in-a-sentence/">Weather</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>the state of the air and atmosphere in a specific place and time</code>
</p>

<ul class="org-ul">
<li>Rainy weather ruined our family picnic soon after we arrived at the park.
</li>
<li>Because of the stormy weather, the children must play indoors only.
</li>
<li>The newsman gave a weather report that called for over two inches of snow over the next twelve hours.
</li>
<li>Florida’s sunny weather makes it the perfect place to go on a vacation.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/welter-in-a-sentence/">Welter</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>wild disorder</code>
</p>

<ul class="org-ul">
<li>The classroom was in a welter when the teacher did not show up for class.
</li>
<li>The frenzied football fans were in the throes of a welter during the final few moments of the game.
</li>
<li>Because she has an issue with hoarding, my grandma’s house is always in a welter.
</li>
<li>The animals at the zoo were always in a welter right before feeding time.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/whimsical-in-a-sentence/">Whimsical</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>in an amusing or playful manner</code>
</p>

<ul class="org-ul">
<li>The whimsical music made me feel like a little kid again.
</li>
<li>During the party, our host asked us to join him in a whimsical game of make-believe.
</li>
<li>The author turned out to be just as whimsical as the magical characters in her children’s book.
</li>
<li>When we went into the interactive candy store, we felt as though we were in a whimsical world made of chocolate.
</li>
<li>It will be interesting to see how my serious mother-in-law responds to the whimsical present I am giving her for her birthday.
</li>
<li>After being stuck in my accountant’s office all day, I looked forward to escaping to the whimsical fantasy game I played with my friends.
</li>
<li>The portrait of the dogs and cats playing cards together is one of the painter’s most whimsical pieces.
</li>
</ul>
</div>
</div>
