ruby/W.org
* [[https://wordsinasentence.com/whimsy-in-a-sentence/][Whimsy]]

  =the quality of being amazing or fantastic=

  - There is a touch of whimsy to this metal sculpture, a certain magical and inspired aura to it that shows how passionate the artist was.
  - There is a sense of whimsy when you get to see the Northern Lights for the first time, as the view is so rare and picturesque it almost seems surreal.
  - I felt a sense of whimsy as we gazed at the stars above us, the hundreds of little lights not diminished by any city lights whatsoever.
  - I felt a great deal of whimsy when I went scuba diving the first time, as the world beneath the waves was almost completely foreign and magical to me.

* [[https://wordsinasentence.com/whittle-in-a-sentence/][Whittle]]

  =to reduce or gradually eliminate something=

  - Her patience began to whittle when the students would not stop talking.
  - Our hiring manager will whittle the number of job applicants from 90 to 3.
  - After the race on the hot day, the store’s stock of bottled waters started to whittle.
  - Due to budget restrictions, Dana’s had to whittle down the list of party invitees.

* [[https://wordsinasentence.com/willful-in-a-sentence/][Willful]]

  =declining to alter one’s behavior or opinions=

  - The willful boy refused to take his seat in class.
  - Because the defendant has a willful disdain for human life, the judge has sentenced him to twenty years in prison.
  - The willful man continued to chase after the happily married woman.
  - Since willful neglect produced the environment in which the customer was mugged, the store owner is facing a huge lawsuit.

* [[https://wordsinasentence.com/wilt-in-a-sentence/][Wilt]]

  =to droop or become limp and soft=

  - I placed an excessive amount of water into the vase on my breakfront because of how quickly the flowers tend to wilt.
  - We worried that the long hours of my new job would cause our relationship to wilt.
  - Although Sam loves expensive flowers, he won’t buy them because they wilt so quickly.
  - Aunt Bella’s daughter does not want her to enter a senior citizens home because she is afraid that it will cause her youthful nature to wilt prematurely.

* [[https://wordsinasentence.com/wistful-in-a-sentence/][Wistful]]

  =sad and reflective=

  - When I visit my mother’s grave, I feel wistful.
  - I became wistful when I saw my ex-boyfriend with his new love.
  - At the end of the dramatic movie, the wistful audience sat in silence as they all pondered the tragedy they had just witnessed.
  - Listening to the sorrows of the blues music always puts Dean in a wistful mood.
  - The wistful song on the radio makes me think of my dead husband.
  - As Henry looked at his old school, he could not help but be wistful as he thought about all the friends he had lost over the years.
  - When my grandmother is feeling wistful, she likes to talk about her years as a teenage girl.

* [[https://wordsinasentence.com/withstood-in-a-sentence/][Withstood]]

  =having resisted or stood firm against some force=

  - The trees withstood the hurricane even though the winds were very strong.
  - Most thought the couple would divorce, but their marriage has withstood the test of time.
  - The metal withstood the first strength test but collapsed during the second trial.
  - Settlers withstood several challenges including a harsh winter and lack of food.

* [[https://wordsinasentence.com/witty-in-a-sentence/][Witty]]

  =using words in a clever and humorous way=

  - Robert’s attempt at a witty comeback fell flat, without evoking any kind of laughter.
  - Although the comic views himself as a witty and clever professional, we all consider him a buffoon.
  - Peter is an elegant, charming and witty person who would make a great master of ceremonies.
  - Eric is a great debater who employs his witty sense of humor when deflecting an attack.

* [[https://wordsinasentence.com/waddle-in-a-sentence/][Waddle]]

  =to take small steps while walking in a stumbling way=

  - As the duck would waddle to the pond, its webbed feet would move back and forth along the path in bobbing motion.
  - When the penguins at the zoo would waddle, children would frequently laugh as their plump bodies would shift from side to side in the enclosure.
  - Being nine months pregnant with triplets, the woman could only waddle slowly around the house due to her protruding stomach.
  - With weak legs, elderly people will often waddle gradually to their destination by planting one foot down on the ground before moving the other.


* [[https://wordsinasentence.com/waggish-in-a-sentence/][Waggish]]

  =acting in a mischievous manner=

  - The waggish teenage boys kept tripping on the ground in hopes of attracting the attention of the pretty girls.
  - At his age, Phil needs to stop behaving in a waggish manner and assume the serious responsibilities of being a husband and father.
  - The waggish employees played computer games and completed very little work when their boss was out of the office.
  - Because the teacher had to maintain her stern reputation, she never let her students know she was amused by their waggish behavior.

* [[https://wordsinasentence.com/waive-in-a-sentence/][Waive]]

  =to give up one’s rights or claims=

  - Because Bill knows he is innocent, he is going to waive his right to an attorney.
  - Some insurance companies will waive rate increases for drivers who have excellent driving records.
  - Since the woman exceeded the speed limit only because she needed medical aid, the police officer chose to waive her speeding ticket.
  - The bank will waive the monthly account fee if I use my debit card five times in a thirty-day period.

* [[https://wordsinasentence.com/wallop-in-a-sentence/][Wallop]]

  =to hit hard=

  - Boxers wallop each other with jabs and punches.
  - The bullies wallop their victim until he's covered with bruises.
  - The golfer hit the ball with a powerful wallop and it flew past the hole into the sand several meters away.
  - During the hail storm, large pieces of ice wallop the cars.

* [[https://wordsinasentence.com/wallow-in-a-sentence/][Wallow]]

  =to indulge in one’s emotions=

  - Ever since April lost her job, she has done nothing but wallow in self-pity.
  - Becky is a strong woman and not the type of person to wallow in gloom.
  - When Marie is depressed, she tends to do nothing but cry and wallow in misery.
  - Justin has done nothing but wallow in sorrow since his girlfriend dumped him.

