ruby/W.html

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/whimsy-in-a-sentence/">Whimsy</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>the quality of being amazing or fantastic</code>
</p>

<ul class="org-ul">
<li>There is a touch of whimsy to this metal sculpture, a certain magical and inspired aura to it that shows how passionate the artist was.
</li>
<li>There is a sense of whimsy when you get to see the Northern Lights for the first time, as the view is so rare and picturesque it almost seems surreal.
</li>
<li>I felt a sense of whimsy as we gazed at the stars above us, the hundreds of little lights not diminished by any city lights whatsoever.
</li>
<li>I felt a great deal of whimsy when I went scuba diving the first time, as the world beneath the waves was almost completely foreign and magical to me.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/whittle-in-a-sentence/">Whittle</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>to reduce or gradually eliminate something</code>
</p>

<ul class="org-ul">
<li>Her patience began to whittle when the students would not stop talking.
</li>
<li>Our hiring manager will whittle the number of job applicants from 90 to 3.
</li>
<li>After the race on the hot day, the store’s stock of bottled waters started to whittle.
</li>
<li>Due to budget restrictions, Dana’s had to whittle down the list of party invitees.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/willful-in-a-sentence/">Willful</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>declining to alter one’s behavior or opinions</code>
</p>

<ul class="org-ul">
<li>The willful boy refused to take his seat in class.
</li>
<li>Because the defendant has a willful disdain for human life, the judge has sentenced him to twenty years in prison.
</li>
<li>The willful man continued to chase after the happily married woman.
</li>
<li>Since willful neglect produced the environment in which the customer was mugged, the store owner is facing a huge lawsuit.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/wilt-in-a-sentence/">Wilt</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to droop or become limp and soft</code>
</p>

<ul class="org-ul">
<li>I placed an excessive amount of water into the vase on my breakfront because of how quickly the flowers tend to wilt.
</li>
<li>We worried that the long hours of my new job would cause our relationship to wilt.
</li>
<li>Although Sam loves expensive flowers, he won’t buy them because they wilt so quickly.
</li>
<li>Aunt Bella’s daughter does not want her to enter a senior citizens home because she is afraid that it will cause her youthful nature to wilt prematurely.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/wistful-in-a-sentence/">Wistful</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>sad and reflective</code>
</p>

<ul class="org-ul">
<li>When I visit my mother’s grave, I feel wistful.
</li>
<li>I became wistful when I saw my ex-boyfriend with his new love.
</li>
<li>At the end of the dramatic movie, the wistful audience sat in silence as they all pondered the tragedy they had just witnessed.
</li>
<li>Listening to the sorrows of the blues music always puts Dean in a wistful mood.
</li>
<li>The wistful song on the radio makes me think of my dead husband.
</li>
<li>As Henry looked at his old school, he could not help but be wistful as he thought about all the friends he had lost over the years.
</li>
<li>When my grandmother is feeling wistful, she likes to talk about her years as a teenage girl.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/withstood-in-a-sentence/">Withstood</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>having resisted or stood firm against some force</code>
</p>

<ul class="org-ul">
<li>The trees withstood the hurricane even though the winds were very strong.
</li>
<li>Most thought the couple would divorce, but their marriage has withstood the test of time.
</li>
<li>The metal withstood the first strength test but collapsed during the second trial.
</li>
<li>Settlers withstood several challenges including a harsh winter and lack of food.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/witty-in-a-sentence/">Witty</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>using words in a clever and humorous way</code>
</p>

<ul class="org-ul">
<li>Robert’s attempt at a witty comeback fell flat, without evoking any kind of laughter.
</li>
<li>Although the comic views himself as a witty and clever professional, we all consider him a buffoon.
</li>
<li>Peter is an elegant, charming and witty person who would make a great master of ceremonies.
</li>
<li>Eric is a great debater who employs his witty sense of humor when deflecting an attack.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/waddle-in-a-sentence/">Waddle</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>to take small steps while walking in a stumbling way</code>
</p>

<ul class="org-ul">
<li>As the duck would waddle to the pond, its webbed feet would move back and forth along the path in bobbing motion.
</li>
<li>When the penguins at the zoo would waddle, children would frequently laugh as their plump bodies would shift from side to side in the enclosure.
</li>
<li>Being nine months pregnant with triplets, the woman could only waddle slowly around the house due to her protruding stomach.
</li>
<li>With weak legs, elderly people will often waddle gradually to their destination by planting one foot down on the ground before moving the other.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/waggish-in-a-sentence/">Waggish</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>acting in a mischievous manner</code>
</p>

<ul class="org-ul">
<li>The waggish teenage boys kept tripping on the ground in hopes of attracting the attention of the pretty girls.
</li>
<li>At his age, Phil needs to stop behaving in a waggish manner and assume the serious responsibilities of being a husband and father.
</li>
<li>The waggish employees played computer games and completed very little work when their boss was out of the office.
</li>
<li>Because the teacher had to maintain her stern reputation, she never let her students know she was amused by their waggish behavior.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/waive-in-a-sentence/">Waive</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>to give up one’s rights or claims</code>
</p>

<ul class="org-ul">
<li>Because Bill knows he is innocent, he is going to waive his right to an attorney.
</li>
<li>Some insurance companies will waive rate increases for drivers who have excellent driving records.
</li>
<li>Since the woman exceeded the speed limit only because she needed medical aid, the police officer chose to waive her speeding ticket.
</li>
<li>The bank will waive the monthly account fee if I use my debit card five times in a thirty-day period.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/wallop-in-a-sentence/">Wallop</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>to hit hard</code>
</p>

<ul class="org-ul">
<li>Boxers wallop each other with jabs and punches.
</li>
<li>The bullies wallop their victim until he's covered with bruises.
</li>
<li>The golfer hit the ball with a powerful wallop and it flew past the hole into the sand several meters away.
</li>
<li>During the hail storm, large pieces of ice wallop the cars.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/wallow-in-a-sentence/">Wallow</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>to indulge in one’s emotions</code>
</p>

<ul class="org-ul">
<li>Ever since April lost her job, she has done nothing but wallow in self-pity.
</li>
<li>Becky is a strong woman and not the type of person to wallow in gloom.
</li>
<li>When Marie is depressed, she tends to do nothing but cry and wallow in misery.
</li>
<li>Justin has done nothing but wallow in sorrow since his girlfriend dumped him.
</li>
</ul>
</div>
</div>
