ruby/W.org
* [[https://wordsinasentence.com/wan-in-a-sentence/][Wan]]

  =weak or pale in quality or appearance=

  - Although the toddler was quite ill, he still managed to give his mother a wan smile.
  - Bill’s parents thought he was abusing drugs because of his wan complexion.
  - After a night of heavy drinking, Brian returned home looking wan and tired.
  - The wan glow from the tiny candle was not enough to fully light up the room.

* [[https://wordsinasentence.com/wanton-in-a-sentence/][Wanton]]

  =having no concern for the rights, feelings, or safety of others=

  - Jim’s wanton disregard for others was obvious when he drove home drunk.
  - Although Harold is not a nice boy, I cannot believe he has been accused of wanton cruelty toward his neighbor’s dog.
  - The judge sentenced the teenage boy to two hundred hours of community service for his wanton acts of vandalism.
  - After surveillance cameras failed to pick up the wanton destruction of the library, the county hired a security guard to patrol the building.
  - The wanton destruction of the historic church drew outrage from all over the country.
  - Although Frank is usually a caring person, he exhibits a wanton personality and overlooks the feelings of others when he drinks too much beer.
  - Alice’s wanton nature led her to believe the laws that governed others did not apply to her.


* [[https://wordsinasentence.com/wastrel-in-a-sentence/][Wastrel]]

  =an individual with a tendency to waste resources and time=

  - Since Bill is a wastrel, he spends most of the day in bed.
  - Claire has the habits of a wastrel and often finds herself in debt as a result of spending money on unnecessary things.
  - After Kate married a wastrel, she learned she would have to be the smart shopper in the family.
  - My son is a wastrel who usually throws his school lunch in the trashcan.

* [[https://wordsinasentence.com/waver-in-a-sentence/][Waver]]

  =to be uncertain=

  - I am certain of my selection so my decision will not waver.
  - Because Mary knew her father would not waver on his decision, she did not bother to ask him again.
  - Mike was not afraid of the bully and showed it by not letting his eyes waver from those of his enemy.
  - Although John thought he wanted to attend a local college, he has started to waver on his choice and is now considering other schools.

* [[https://wordsinasentence.com/waylay-in-a-sentence/][Waylay]]

  =to actively block an individual’s path in order to interrogate, detain, etc.=

  - Reporters attempted to waylay the celebrity at the airport and bombard him with questions, but his security team intervened.
  - The boxer's opponent made to waylay and provoke him before the match, but he stormed through his defenses and into the ring.
  - The police officer stepped in front of the distraught woman to waylay her before she reached the crime scene.
  - Her nosy grandmother often tried to waylay her with pointless conversations about her love life before she left the house.

* [[https://wordsinasentence.com/wean-in-a-sentence/][Wean]]

  =to gradually eliminate a thing from your life=

  - I’m trying to wean myself off soda by drinking fewer each day.
  - The kitten will need to wean off of its mother’s milk and start drinking out of a bowl.
  - We are trying to wean my toddler from sucking a pacifier, but she hasn’t let go yet.
  - The patient must wean his body off alcohol before he can leave the hospital.

* [[https://wordsinasentence.com/weary-in-a-sentence/][Weary]]

  =worn out; exhausted=

  - After the long road trip, we were all so weary we fell asleep in our clothes.
  - Warren was very weary after his cancer treatments.
  - When my eyes grew weary, I closed the book I was reading and took a nap.
  - The sixteen-hour plane trip left Heather feeling rather weary.

* [[https://wordsinasentence.com/wend-in-a-sentence/][Wend]]

  =to follow a set direction or path=

  - Miles of trails wend their way through the trees and meadows.
  - I need to wend my way back to the cabin before night falls.
  - Although the charges were eventually dropped, it took the defendant years to wend himself through the legal system.
  - The law must wend its way through congress before getting full approval.

* [[https://wordsinasentence.com/wheedle-in-a-sentence/][Wheedle]]

  =to try and persuade using flattery=

  - After Bill forgot his wedding anniversary, he attempted to wheedle his way back into his wife’s heart by surprising her with a romantic getaway.
  - My daughter will pretend to cry if she thinks it will allow her to wheedle out of a consequence.
  - When my sister could not pay her light bill, she batted her eyelashes at the clerk in an attempt to wheedle an extension.
  - It was so easy for the model to wheedle her way out of a ticket by smiling at the patrolman.
  - Although I would love to get into the exclusive area of the club, I am not willing to wheedle my way in by flirting with the unattractive security guard.
  - Credit card companies try to wheedle money out of their customers by rewarding them with credit increases.
  - When Elaine wanted free drinks, she would wheedle them by flirting with intoxicated men.

* [[https://wordsinasentence.com/wheeze-in-a-sentence/][Wheeze]]

  =to breathe with a whistling or rattling sound in the chest=

  - Because of an infection in his lungs, the patient will wheeze anytime he breathes in air too deeply.
  - Bacteria in the air can make a person who breathes normally sniffle and wheeze.
  - Studies show that kids who eat nuts at least three times a week are less like to wheeze or rattle when they breathe.
  - An allergic reaction to something she ate caused the little girl to wheeze and rasp every time she took a breath.

* [[https://wordsinasentence.com/whet-in-a-sentence/][Whet]]

  =to trigger or make desire=

  - The mobile phone company uses celebrity endorsements to make consumers whet their phones.
  - As I walked up my grandmother’s steps, I realized the smell of her food was enough to whet my appetite.
  - The president gave the journalists just enough information to whet their curiosities.
  - While I was at work, my wife sent me pictures of her new lingerie in order to whet my desire.

