ruby/W.html

<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/wan-in-a-sentence/">Wan</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>weak or pale in quality or appearance</code>
</p>

<ul class="org-ul">
<li>Although the toddler was quite ill, he still managed to give his mother a wan smile.
</li>
<li>Bill’s parents thought he was abusing drugs because of his wan complexion.
</li>
<li>After a night of heavy drinking, Brian returned home looking wan and tired.
</li>
<li>The wan glow from the tiny candle was not enough to fully light up the room.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/wanton-in-a-sentence/">Wanton</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>having no concern for the rights, feelings, or safety of others</code>
</p>

<ul class="org-ul">
<li>Jim’s wanton disregard for others was obvious when he drove home drunk.
</li>
<li>Although Harold is not a nice boy, I cannot believe he has been accused of wanton cruelty toward his neighbor’s dog.
</li>
<li>The judge sentenced the teenage boy to two hundred hours of community service for his wanton acts of vandalism.
</li>
<li>After surveillance cameras failed to pick up the wanton destruction of the library, the county hired a security guard to patrol the building.
</li>
<li>The wanton destruction of the historic church drew outrage from all over the country.
</li>
<li>Although Frank is usually a caring person, he exhibits a wanton personality and overlooks the feelings of others when he drinks too much beer.
</li>
<li>Alice’s wanton nature led her to believe the laws that governed others did not apply to her.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/wastrel-in-a-sentence/">Wastrel</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>an individual with a tendency to waste resources and time</code>
</p>

<ul class="org-ul">
<li>Since Bill is a wastrel, he spends most of the day in bed.
</li>
<li>Claire has the habits of a wastrel and often finds herself in debt as a result of spending money on unnecessary things.
</li>
<li>After Kate married a wastrel, she learned she would have to be the smart shopper in the family.
</li>
<li>My son is a wastrel who usually throws his school lunch in the trashcan.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/waver-in-a-sentence/">Waver</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>to be uncertain</code>
</p>

<ul class="org-ul">
<li>I am certain of my selection so my decision will not waver.
</li>
<li>Because Mary knew her father would not waver on his decision, she did not bother to ask him again.
</li>
<li>Mike was not afraid of the bully and showed it by not letting his eyes waver from those of his enemy.
</li>
<li>Although John thought he wanted to attend a local college, he has started to waver on his choice and is now considering other schools.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/waylay-in-a-sentence/">Waylay</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>to actively block an individual’s path in order to interrogate, detain, etc.</code>
</p>

<ul class="org-ul">
<li>Reporters attempted to waylay the celebrity at the airport and bombard him with questions, but his security team intervened.
</li>
<li>The boxer's opponent made to waylay and provoke him before the match, but he stormed through his defenses and into the ring.
</li>
<li>The police officer stepped in front of the distraught woman to waylay her before she reached the crime scene.
</li>
<li>Her nosy grandmother often tried to waylay her with pointless conversations about her love life before she left the house.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/wean-in-a-sentence/">Wean</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>to gradually eliminate a thing from your life</code>
</p>

<ul class="org-ul">
<li>I’m trying to wean myself off soda by drinking fewer each day.
</li>
<li>The kitten will need to wean off of its mother’s milk and start drinking out of a bowl.
</li>
<li>We are trying to wean my toddler from sucking a pacifier, but she hasn’t let go yet.
</li>
<li>The patient must wean his body off alcohol before he can leave the hospital.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/weary-in-a-sentence/">Weary</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>worn out; exhausted</code>
</p>

<ul class="org-ul">
<li>After the long road trip, we were all so weary we fell asleep in our clothes.
</li>
<li>Warren was very weary after his cancer treatments.
</li>
<li>When my eyes grew weary, I closed the book I was reading and took a nap.
</li>
<li>The sixteen-hour plane trip left Heather feeling rather weary.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/wend-in-a-sentence/">Wend</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>to follow a set direction or path</code>
</p>

<ul class="org-ul">
<li>Miles of trails wend their way through the trees and meadows.
</li>
<li>I need to wend my way back to the cabin before night falls.
</li>
<li>Although the charges were eventually dropped, it took the defendant years to wend himself through the legal system.
</li>
<li>The law must wend its way through congress before getting full approval.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/wheedle-in-a-sentence/">Wheedle</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>to try and persuade using flattery</code>
</p>

<ul class="org-ul">
<li>After Bill forgot his wedding anniversary, he attempted to wheedle his way back into his wife’s heart by surprising her with a romantic getaway.
</li>
<li>My daughter will pretend to cry if she thinks it will allow her to wheedle out of a consequence.
</li>
<li>When my sister could not pay her light bill, she batted her eyelashes at the clerk in an attempt to wheedle an extension.
</li>
<li>It was so easy for the model to wheedle her way out of a ticket by smiling at the patrolman.
</li>
<li>Although I would love to get into the exclusive area of the club, I am not willing to wheedle my way in by flirting with the unattractive security guard.
</li>
<li>Credit card companies try to wheedle money out of their customers by rewarding them with credit increases.
</li>
<li>When Elaine wanted free drinks, she would wheedle them by flirting with intoxicated men.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/wheeze-in-a-sentence/">Wheeze</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>to breathe with a whistling or rattling sound in the chest</code>
</p>

<ul class="org-ul">
<li>Because of an infection in his lungs, the patient will wheeze anytime he breathes in air too deeply.
</li>
<li>Bacteria in the air can make a person who breathes normally sniffle and wheeze.
</li>
<li>Studies show that kids who eat nuts at least three times a week are less like to wheeze or rattle when they breathe.
</li>
<li>An allergic reaction to something she ate caused the little girl to wheeze and rasp every time she took a breath.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/whet-in-a-sentence/">Whet</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>to trigger or make desire</code>
</p>

<ul class="org-ul">
<li>The mobile phone company uses celebrity endorsements to make consumers whet their phones.
</li>
<li>As I walked up my grandmother’s steps, I realized the smell of her food was enough to whet my appetite.
</li>
<li>The president gave the journalists just enough information to whet their curiosities.
</li>
<li>While I was at work, my wife sent me pictures of her new lingerie in order to whet my desire.
</li>
</ul>
</div>
</div>
