ruby/W.org
* [[https://wordsinasentence.com/wither-in-a-sentence/][Wither]]

  =dry up or shrivel=

  - The gardener’s plants began to wither in the heat of the sun.
  - My grandfather said that he would wither away if my mother wasn’t there to take care of him.
  - The drought caused our crops to wither.
  - Because I colored my hair so often, it began to wither from the dye.

* [[https://wordsinasentence.com/wizened-in-a-sentence/][Wizened]]

  =wrinkly from sickness or old age=

  - While the flowers arrived looking fresh and beautiful, they have grown wizened over the past few days.
  - My grandmother’s wizened face broke into a smile when I placed my newborn daughter in her arms.
  - Even though Will looks like a wizened old man who cannot care for himself, he is actually an active senior who enjoys skydiving.
  - As a singer mother with eight difficult children, Jane was not surprised when her appearance became wizened in her early fifties.

* [[https://wordsinasentence.com/wobble-in-a-sentence/][Wobble]]

  =to move unsteadily from side to side=

  - While learning to walk, the toddler would wobble from side to side.
  - Because one of its legs is lose, the table might wobble if something is placed on it.
  - The runner was so weak after his marathon that his legs began to wobble and shake.
  - As Ed pushed the wheelbarrow down the hill, its loose wheel began to wobble back and forth.

* [[https://wordsinasentence.com/wrath-in-a-sentence/][Wrath]]

  =intense anger=

  - In mythology mortals generally feared the wrath of the powerful gods.
  - The man earned the wrath of an entire nation when he assassinated the president.
  - Since the police have not arrested the crooked officers on the force, they now have to deal with the public’s wrath.
  - I will not testify against the gangster because I am afraid of his wrath.
  - During parent-teacher conferences, teachers often have to deal with the wrath of dissatisfied parents.
  - All the cheerleaders knew to agree with their captain or else they would incur her wrath.
  - During the vote, the senator from Georgia voted against the tax increase in order to avoid the wrath of his voters.

* [[https://wordsinasentence.com/wreak-in-a-sentence/][Wreak]]

  =cause a lot of damage or harm=

  - If the internet goes down, it will wreak havoc with our ability to communicate and continue doing any kind of business.
  - The storm will wreak terrible damage on Phil’s home if he does not place sandbags everywhere.
  - Budget uncertainty will wreak further havoc, so please make sure to have all your numbers ready for the meeting.
  - Given the havoc that a fire can wreak, the fire department urges everyone to have a family plan in place, in case of an emergency.

* [[https://wordsinasentence.com/wrenching-in-a-sentence/][Wrenching]]

  =forcefully pulling away from something or someone=

  - The football player tried wrenching the ball from the other team member’s hands, but his grip was too strong.
  - Wrenching the door open with enough force that it slammed against the wall, Bridget stormed into the house to confront her lying best friend.
  - Large gusts of wind from the hurricane were wrenching the patio doors open with such force that they were pulled off the hinges.
  - The wrestler tried wrenching himself from his opponent’s headlock by twisting and pulling on his arms.

* [[https://wordsinasentence.com/wrest-in-a-sentence/][Wrest]]

  =to forcefully take something away=

  - My wife had to wrest the candy bar from my hands in order for me to stop eating it.
  - Rita felt she had to wrest the weapon from the hostage-taker for the sake of her safety.
  - Sally did not give up her phone easily as her father had to wrest it from her hands.
  - He had to wrest himself free from ropes to escape.

* [[https://wordsinasentence.com/wretched-in-a-sentence/][Wretched]]

  =incredibly miserable=

  - After a night of overindulging in rich foods and alcoholic drinks, I am wretched.
  - The migraine made Cathy feel wretched.
  - Despite Bill’s wretched childhood, he grew up to be a successful well-adjusted man.
  - The people on the stranded cruise ship became wretched after a couple of days.

* [[https://wordsinasentence.com/writ-in-a-sentence/][Writ]]

  =the power to enforce submission and compliance=

  - It is beyond the writ of adults to punish children that are not their own for misbehavior regardless of how bad it is.
  - Enforcing justice is something beyond the writ of the average citizen, which is why they are not allowed to take the law into their own hands.
  - Some people believe that no one has the writ to enforce their will over others, but without that we have no government and no order.
  - Rebellious teenagers like to think that being forced to follow their parent’s rules is beyond their writ even though their parents have that right and power.

* [[https://wordsinasentence.com/wrought-in-a-sentence/][Wrought]]

  =prepared in some manner, usually by hammering or applying another type of pressure=

  - As we stared at the wrought iron gate, we could not help but wonder about the craftsman who had created the masterpiece.
  - The wrought metal will soon be used to construct the new bridge.
  - Because the wrought iron gates are massive in size, it takes a while for them to open.
  - My wife will not be satisfied if I do not purchase the wrought iron furniture for the patio.

* [[https://wordsinasentence.com/wry-in-a-sentence/][Wry]]

  =describes something sarcastic or a bit humorous=

  - Bill's wry sense of humor made it difficult to be taken seriously at the office.
  - When I asked Lauren "What's up?" she gave me this wry response "The sky!"
  - Realizing that he had been found, the hiding boy gave a wry smile.
  - The girl’s wry sense of humor causes her to laugh in the most inappropriate situations.
  - When I was driving, I saw a wry bumper sticker that read, "4 out of 3 people have trouble with fractions."
  - The wry man said he stops looking for work when he finds a job.
  - "An apple a day keeps the doctor away, especially if you throw it at him," said the wry Grandmother, known for her witty sayings.








#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>